java/java-lib-spring-data.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-03-15 Sun 22:32 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Spring Data</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jinghui Hu" />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../readme.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Spring Data</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge4095b4">1. Spring Data JPA</a></li>
<li><a href="#orgd1d934e">2. 格式化 JSON 的时间字符串</a></li>
</ul>
</div>
</div>


<div id="outline-container-orge4095b4" class="outline-2">
<h2 id="orge4095b4"><span class="section-number-2">1</span> Spring Data JPA</h2>
<div class="outline-text-2" id="text-1">
<p>
JPA(Java Persistence API)意即 Java 持久化 API，是 Sun 官方在 JDK5.0 后提出的
Java 持久化规范。JPA 的出现主要是为了简化持久层开发以及整合 ORM 技术，结束
Hibernate、TopLink、JDO 等 ORM 框架各自为营的局面。JPA 是在吸收现有 ORM 框架
的基础上发展而来，易于使用，伸缩性强。总的来说，JPA 包括以下 3 方面的技术：
</p>

<ul class="org-ul">
<li>ORM 映射元数据： 支持 XML 和注解两种元数据的形式，元数据描述对象和表之间的
映射关系</li>
<li>API： 操作实体对象来执行 CRUD 操作</li>
<li>查询语言： 通过面向对象而非面向数据库的查询语言（JPQL）查询数据，避免程序的
SQL 语句紧密耦合</li>
</ul>

<p>
<a href="https://spring.io/projects/spring-data-jpa#overview">Spring Data JPA </a>是 Spring Data 家族的一部分，可以轻松实现基于 JPA 的存储库。
此模块处理对基于 JPA 的数据访问层的增强支持。 它使构建使用数据访问技术的
Spring 驱动应用程序变得更加容易。其代码托管于 <a href="https://github.com/spring-projects/spring-data-jpa">GitHub</a> ， 文档见 <a href="https://docs.spring.io/spring-data/jpa/docs/current/reference/html/">reference</a> 。
</p>
</div>
</div>

<div id="outline-container-orgd1d934e" class="outline-2">
<h2 id="orgd1d934e"><span class="section-number-2">2</span> 格式化 JSON 的时间字符串</h2>
<div class="outline-text-2" id="text-2">
<p>
使用 JsonFormat 标注可以设置 JSON 字段序列化的格式
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #859900;">import</span> <span style="color: #268bd2;">com</span>.<span style="color: #268bd2;">fasterxml</span>.<span style="color: #268bd2;">jackson</span>.<span style="color: #268bd2;">annotation</span>.<span style="color: #268bd2;">JsonFormat</span>;
<span style="color: #859900;">import</span> <span style="color: #268bd2;">com</span>.<span style="color: #268bd2;">fasterxml</span>.<span style="color: #268bd2;">jackson</span>.<span style="color: #268bd2;">annotation</span>.<span style="color: #268bd2;">JsonProperty</span>;

<span style="color: #859900;">class</span> <span style="color: #268bd2;">ExampleEntity</span> <span style="color: #8d5649;">{</span>

  <span style="color: #268bd2;">@Column</span><span style="color: #d8241f;">(</span>name = <span style="color: #2aa198;">"BIRTHDAY"</span><span style="color: #d8241f;">)</span>
  <span style="color: #268bd2;">@JsonFormat</span><span style="color: #d8241f;">(</span>pattern = <span style="color: #2aa198;">"yyyy-MM-dd"</span><span style="color: #d8241f;">)</span>
  <span style="color: #859900;">private</span> <span style="color: #268bd2;">Timestamp</span> <span style="color: #6c71c4;">birthday</span>; <span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">&#20986;&#29983;&#26085;&#26399;</span>

  <span style="color: #268bd2;">@JsonProperty</span><span style="color: #d8241f;">(</span><span style="color: #2aa198;">"birthday"</span><span style="color: #d8241f;">)</span>
  <span style="color: #859900;">public</span> <span style="color: #268bd2;">Timestamp</span> <span style="color: #b58900;">birthday</span><span style="color: #d8241f;">()</span> <span style="color: #d8241f;">{</span>
    <span style="color: #859900;">return</span> <span style="color: #859900;">this</span>.birthday;
  <span style="color: #d8241f;">}</span>

  <span style="color: #859900;">public</span> <span style="color: #268bd2;">void</span> <span style="color: #b58900;">birthday</span><span style="color: #d8241f;">(</span><span style="color: #268bd2;">Timestamp</span> <span style="color: #6c71c4;">birthday</span><span style="color: #d8241f;">)</span> <span style="color: #d8241f;">{</span>
    <span style="color: #859900;">this</span>.birthday = birthday;
  <span style="color: #d8241f;">}</span>
<span style="color: #8d5649;">}</span>
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Last Updated 2020-03-15 Sun 22:32. Created by Jinghui Hu at 2020-03-15 Sun 22:31.</p>
</div>
</body>
</html>
